In [1]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

In [2]:

# Extracción: Cargar datos desde el archivo movies.csv
# Juan José Hernández - 2259500 
# Juan José Gallego - 2259433 
# Nicolas Rojas - 2259460 
print("Extrayendo datos del CSV...")
csv_file = "proyecto.csv"  # Ruta del archivo CSV
df = pd.read_csv(csv_file)
print("Datos extraídos correctamente.")
df.head()  # Muestra las primeras filas para verificar

Extrayendo datos del CSV...
Datos extraídos correctamente.

,invoice_no,customer_id,gender,age,category,quantity,price,payment_method,invoice_date,shopping_mall
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,5/8/2022,Kanyon
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,12/12/2021,Forum Istanbul
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,9/11/2021,Metrocity
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,16/05/2021,Metropol AVM
4,I337046,C189076,Female,53,Books,4,60.60,Cash,24/10/2021,Kanyon

In [3]:
df.info

<bound method DataFrame.info of       invoice_no customer_id  gender  age         category  quantity    price  \
0        I138884     C241288  Female   28         Clothing         5  1500.40
1        I317333     C111565    Male   21            Shoes         3  1800.51
2        I127801     C266599    Male   20         Clothing         1   300.08
3        I173702     C988172  Female   66            Shoes         5  3000.85
4        I337046     C189076  Female   53            Books         4    60.60
...          ...         ...     ...  ...              ...       ...      ...
99452    I219422     C441542  Female   45         Souvenir         5    58.65
99453    I325143     C569580    Male   27  Food & Beverage         2    10.46
99454    I824010     C103292    Male   63  Food & Beverage         2    10.46
99455    I702964     C800631    Male   56       Technology         4  4200.00
99456    I232867     C273973  Female   36         Souvenir         3    35.19

      payment_method invoice_date     shopping_mall
0        Credit Card     5/8/2022            Kanyon
1         Debit Card   12/12/2021    Forum Istanbul
2               Cash    9/11/2021         Metrocity
3        Credit Card   16/05/2021      Metropol AVM
4               Cash   24/10/2021            Kanyon
...              ...          ...               ...
99452    Credit Card   21/09/2022            Kanyon
99453           Cash   22/09/2021    Forum Istanbul
99454     Debit Card   28/03/2021         Metrocity
99455           Cash   16/03/2021      Istinye Park
99456    Credit Card   15/10/2022  Mall of Istanbul

[99457 rows x 10 columns]>

In [4]:
df_copia = df.copy()

In [5]:
df.rename(columns={'price': 'total_price'}, inplace=True)
df.rename(columns={'category': 'product'}, inplace=True)
df

,invoice_no,customer_id,gender,age,product,quantity,total_price,payment_method,invoice_date,shopping_mall
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,5/8/2022,Kanyon
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,12/12/2021,Forum Istanbul
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,9/11/2021,Metrocity
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,16/05/2021,Metropol AVM
4,I337046,C189076,Female,53,Books,4,60.60,Cash,24/10/2021,Kanyon
...,...,...,...,...,...,...,...,...,...,...
99452,I219422,C441542,Female,45,Souvenir,5,58.65,Credit Card,21/09/2022,Kanyon
99453,I325143,C569580,Male,27,Food & Beverage,2,10.46,Cash,22/09/2021,Forum Istanbul
99454,I824010,C103292,Male,63,Food & Beverage,2,10.46,Debit Card,28/03/2021,Metrocity
99455,I702964,C800631,Male,56,Technology,4,4200.00,Cash,16/03/2021,Istinye Park
99456,I232867,C273973,Female,36,Souvenir,3,35.19,Credit Card,15/10/2022,Mall of Istanbul

In [6]:
product = df[['product']]
product

               product
0             Clothing
1                Shoes
2             Clothing
3                Shoes
4                Books
...                ...
99452         Souvenir
99453  Food & Beverage
99454  Food & Beverage
99455       Technology
99456         Souvenir

[99457 rows x 1 columns]

In [7]:
product['unit_price'] = df['total_price'] / df['quantity']
product

C:\Users\juanj\AppData\Local\Temp\ipykernel_11364\1485472766.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  product['unit_price'] = df['total_price'] / df['quantity']

               product  unit_price
0             Clothing      300.08
1                Shoes      600.17
2             Clothing      300.08
3                Shoes      600.17
4                Books       15.15
...                ...         ...
99452         Souvenir       11.73
99453  Food & Beverage        5.23
99454  Food & Beverage        5.23
99455       Technology     1050.00
99456         Souvenir       11.73

[99457 rows x 2 columns]

In [8]:
product = product.copy().drop_duplicates(subset=['product']).reset_index(drop=True)
product['product_id'] = product.index + 1
product

           product  unit_price  product_id
0         Clothing      300.08           1
1            Shoes      600.17           2
2            Books       15.15           3
3        Cosmetics       40.66           4
4  Food & Beverage        5.23           5
5             Toys       35.84           6
6       Technology     1050.00           7
7         Souvenir       11.73           8

In [9]:
df = df.merge(product, on='product', how='left')
df

,invoice_no,customer_id,gender,age,product,quantity,total_price,payment_method,invoice_date,shopping_mall,unit_price,product_id
0,I138884,C241288,Female,28,Clothing,5,1500.40,Credit Card,5/8/2022,Kanyon,300.08,1
1,I317333,C111565,Male,21,Shoes,3,1800.51,Debit Card,12/12/2021,Forum Istanbul,600.17,2
2,I127801,C266599,Male,20,Clothing,1,300.08,Cash,9/11/2021,Metrocity,300.08,1
3,I173702,C988172,Female,66,Shoes,5,3000.85,Credit Card,16/05/2021,Metropol AVM,600.17,2
4,I337046,C189076,Female,53,Books,4,60.60,Cash,24/10/2021,Kanyon,15.15,3
...,...,...,...,...,...,...,...,...,...,...,...,...
99452,I219422,C441542,Female,45,Souvenir,5,58.65,Credit Card,21/09/2022,Kanyon,11.73,8
99453,I325143,C569580,Male,27,Food & Beverage,2,10.46,Cash,22/09/2021,Forum Istanbul,5.23,5
99454,I824010,C103292,Male,63,Food & Beverage,2,10.46,Debit Card,28/03/2021,Metrocity,5.23,5
99455,I702964,C800631,Male,56,Technology,4,4200.00,Cash,16/03/2021,Istinye Park,1050.00,7
99456,I232867,C273973,Female,36,Souvenir,3,35.19,Credit Card,15/10/2022,Mall of Istanbul,11.73,8

In [10]:
df = df.drop(columns=['product','unit_price'])
df

,invoice_no,customer_id,gender,age,quantity,total_price,payment_method,invoice_date,shopping_mall,product_id
0,I138884,C241288,Female,28,5,1500.40,Credit Card,5/8/2022,Kanyon,1
1,I317333,C111565,Male,21,3,1800.51,Debit Card,12/12/2021,Forum Istanbul,2
2,I127801,C266599,Male,20,1,300.08,Cash,9/11/2021,Metrocity,1
3,I173702,C988172,Female,66,5,3000.85,Credit Card,16/05/2021,Metropol AVM,2
4,I337046,C189076,Female,53,4,60.60,Cash,24/10/2021,Kanyon,3
...,...,...,...,...,...,...,...,...,...,...
99452,I219422,C441542,Female,45,5,58.65,Credit Card,21/09/2022,Kanyon,8
99453,I325143,C569580,Male,27,2,10.46,Cash,22/09/2021,Forum Istanbul,5
99454,I824010,C103292,Male,63,2,10.46,Debit Card,28/03/2021,Metrocity,5
99455,I702964,C800631,Male,56,4,4200.00,Cash,16/03/2021,Istinye Park,7
99456,I232867,C273973,Female,36,3,35.19,Credit Card,15/10/2022,Mall of Istanbul,8

In [11]:
date = df[['invoice_date']]
date

      invoice_date
0         5/8/2022
1       12/12/2021
2        9/11/2021
3       16/05/2021
4       24/10/2021
...            ...
99452   21/09/2022
99453   22/09/2021
99454   28/03/2021
99455   16/03/2021
99456   15/10/2022

[99457 rows x 1 columns]

In [12]:
date [['day','month','year']] = date['invoice_date'].str.split('/',expand=True)
date

C:\Users\juanj\AppData\Local\Temp\ipykernel_11364\1790536063.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  date [['day','month','year']] = date['invoice_date'].str.split('/',expand=True)
C:\Users\juanj\AppData\Local\Temp\ipykernel_11364\1790536063.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  date [['day','month','year']] = date['invoice_date'].str.split('/',expand=True)
C:\Users\juanj\AppData\Local\Temp\ipykernel_11364\1790536063.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  date [['day','month','year']] = date['invoice_date'].str.split('/',expand=True)

      invoice_date day month  year
0         5/8/2022   5     8  2022
1       12/12/2021  12    12  2021
2        9/11/2021   9    11  2021
3       16/05/2021  16    05  2021
4       24/10/2021  24    10  2021
...            ...  ..   ...   ...
99452   21/09/2022  21    09  2022
99453   22/09/2021  22    09  2021
99454   28/03/2021  28    03  2021
99455   16/03/2021  16    03  2021
99456   15/10/2022  15    10  2022

[99457 rows x 4 columns]

In [13]:
date = date.drop_duplicates(subset=['day','month','year']).reset_index(drop=True)
date['date_id'] = date.index + 1
date

    invoice_date day month  year  date_id
0       5/8/2022   5     8  2022        1
1     12/12/2021  12    12  2021        2
2      9/11/2021   9    11  2021        3
3     16/05/2021  16    05  2021        4
4     24/10/2021  24    10  2021        5
..           ...  ..   ...   ...      ...
792   29/01/2021  29    01  2021      793
793     1/1/2021   1     1  2021      794
794    12/8/2021  12     8  2021      795
795     8/1/2022   8     1  2022      796
796    11/5/2021  11     5  2021      797

[797 rows x 5 columns]

In [14]:
df = df.merge(date, on='invoice_date', how='left')
df

,invoice_no,customer_id,gender,age,quantity,total_price,payment_method,invoice_date,shopping_mall,product_id,day,month,year,date_id
0,I138884,C241288,Female,28,5,1500.40,Credit Card,5/8/2022,Kanyon,1,5,8,2022,1
1,I317333,C111565,Male,21,3,1800.51,Debit Card,12/12/2021,Forum Istanbul,2,12,12,2021,2
2,I127801,C266599,Male,20,1,300.08,Cash,9/11/2021,Metrocity,1,9,11,2021,3
3,I173702,C988172,Female,66,5,3000.85,Credit Card,16/05/2021,Metropol AVM,2,16,05,2021,4
4,I337046,C189076,Female,53,4,60.60,Cash,24/10/2021,Kanyon,3,24,10,2021,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
99452,I219422,C441542,Female,45,5,58.65,Credit Card,21/09/2022,Kanyon,8,21,09,2022,103
99453,I325143,C569580,Male,27,2,10.46,Cash,22/09/2021,Forum Istanbul,5,22,09,2021,423
99454,I824010,C103292,Male,63,2,10.46,Debit Card,28/03/2021,Metrocity,5,28,03,2021,164
99455,I702964,C800631,Male,56,4,4200.00,Cash,16/03/2021,Istinye Park,7,16,03,2021,544
99456,I232867,C273973,Female,36,3,35.19,Credit Card,15/10/2022,Mall of Istanbul,8,15,10,2022,83

In [15]:
df = df.drop(columns=['invoice_date','day','month','year'])
df

,invoice_no,customer_id,gender,age,quantity,total_price,payment_method,shopping_mall,product_id,date_id
0,I138884,C241288,Female,28,5,1500.40,Credit Card,Kanyon,1,1
1,I317333,C111565,Male,21,3,1800.51,Debit Card,Forum Istanbul,2,2
2,I127801,C266599,Male,20,1,300.08,Cash,Metrocity,1,3
3,I173702,C988172,Female,66,5,3000.85,Credit Card,Metropol AVM,2,4
4,I337046,C189076,Female,53,4,60.60,Cash,Kanyon,3,5
...,...,...,...,...,...,...,...,...,...,...
99452,I219422,C441542,Female,45,5,58.65,Credit Card,Kanyon,8,103
99453,I325143,C569580,Male,27,2,10.46,Cash,Forum Istanbul,5,423
99454,I824010,C103292,Male,63,2,10.46,Debit Card,Metrocity,5,164
99455,I702964,C800631,Male,56,4,4200.00,Cash,Istinye Park,7,544
99456,I232867,C273973,Female,36,3,35.19,Credit Card,Mall of Istanbul,8,83

In [16]:
date = date.drop(columns=['invoice_date'])
date

    day month  year  date_id
0     5     8  2022        1
1    12    12  2021        2
2     9    11  2021        3
3    16    05  2021        4
4    24    10  2021        5
..   ..   ...   ...      ...
792  29    01  2021      793
793   1     1  2021      794
794  12     8  2021      795
795   8     1  2022      796
796  11     5  2021      797

[797 rows x 4 columns]

In [17]:
shopping_mall = df[['shopping_mall']]
shopping_mall = shopping_mall.drop_duplicates(subset=['shopping_mall']).reset_index(drop=True)
shopping_mall['shopping_mall_id'] = shopping_mall.index + 1
shopping_mall

       shopping_mall  shopping_mall_id
0             Kanyon                 1
1     Forum Istanbul                 2
2          Metrocity                 3
3       Metropol AVM                 4
4       Istinye Park                 5
5   Mall of Istanbul                 6
6  Emaar Square Mall                 7
7        Cevahir AVM                 8
8     Viaport Outlet                 9
9       Zorlu Center                10

In [18]:
df = df.merge(shopping_mall, on='shopping_mall', how='left')
df = df.drop(columns=['shopping_mall'])
df

,invoice_no,customer_id,gender,age,quantity,total_price,payment_method,product_id,date_id,shopping_mall_id
0,I138884,C241288,Female,28,5,1500.40,Credit Card,1,1,1
1,I317333,C111565,Male,21,3,1800.51,Debit Card,2,2,2
2,I127801,C266599,Male,20,1,300.08,Cash,1,3,3
3,I173702,C988172,Female,66,5,3000.85,Credit Card,2,4,4
4,I337046,C189076,Female,53,4,60.60,Cash,3,5,1
...,...,...,...,...,...,...,...,...,...,...
99452,I219422,C441542,Female,45,5,58.65,Credit Card,8,103,1
99453,I325143,C569580,Male,27,2,10.46,Cash,5,423,2
99454,I824010,C103292,Male,63,2,10.46,Debit Card,5,164,3
99455,I702964,C800631,Male,56,4,4200.00,Cash,7,544,5
99456,I232867,C273973,Female,36,3,35.19,Credit Card,8,83,6

In [19]:
client = df[['customer_id','gender','age']].copy()
client

      customer_id  gender  age
0         C241288  Female   28
1         C111565    Male   21
2         C266599    Male   20
3         C988172  Female   66
4         C189076  Female   53
...           ...     ...  ...
99452     C441542  Female   45
99453     C569580    Male   27
99454     C103292    Male   63
99455     C800631    Male   56
99456     C273973  Female   36

[99457 rows x 3 columns]

In [20]:
df = df.drop(columns=['gender','age'])
df

,invoice_no,customer_id,quantity,total_price,payment_method,product_id,date_id,shopping_mall_id
0,I138884,C241288,5,1500.40,Credit Card,1,1,1
1,I317333,C111565,3,1800.51,Debit Card,2,2,2
2,I127801,C266599,1,300.08,Cash,1,3,3
3,I173702,C988172,5,3000.85,Credit Card,2,4,4
4,I337046,C189076,4,60.60,Cash,3,5,1
...,...,...,...,...,...,...,...,...
99452,I219422,C441542,5,58.65,Credit Card,8,103,1
99453,I325143,C569580,2,10.46,Cash,5,423,2
99454,I824010,C103292,2,10.46,Debit Card,5,164,3
99455,I702964,C800631,4,4200.00,Cash,7,544,5
99456,I232867,C273973,3,35.19,Credit Card,8,83,6

In [21]:
payment_method = df[['payment_method']] 
payment_method = payment_method.drop_duplicates(subset=['payment_method']).reset_index(drop=True)
payment_method['payment_id'] = payment_method.index + 1
payment_method

  payment_method  payment_id
0    Credit Card           1
1     Debit Card           2
2           Cash           3

In [22]:
df = df.merge(payment_method, on='payment_method', how='left')
df = df.drop(columns=['payment_method'])
df

,invoice_no,customer_id,quantity,total_price,product_id,date_id,shopping_mall_id,payment_id
0,I138884,C241288,5,1500.40,1,1,1,1
1,I317333,C111565,3,1800.51,2,2,2,2
2,I127801,C266599,1,300.08,1,3,3,3
3,I173702,C988172,5,3000.85,2,4,4,1
4,I337046,C189076,4,60.60,3,5,1,3
...,...,...,...,...,...,...,...,...
99452,I219422,C441542,5,58.65,8,103,1,1
99453,I325143,C569580,2,10.46,5,423,2,3
99454,I824010,C103292,2,10.46,5,164,3,2
99455,I702964,C800631,4,4200.00,7,544,5,3
99456,I232867,C273973,3,35.19,8,83,6,1

In [23]:
from sqlalchemy import create_engine

In [24]:
engine = create_engine("postgresql://neondb_owner:npg_CEr1lwtZ8fnR@ep-flat-dust-a5ouuo41-pooler.us-east-2.aws.neon.tech/neondb?sslmode=require")

In [25]:
df.to_sql('invoice', engine, if_exists='replace', index=False)
product.to_sql('product', engine, if_exists='replace', index=False)
date.to_sql('date', engine, if_exists='replace', index=False)
shopping_mall.to_sql('shopping_mall', engine, if_exists='replace', index=False)
payment_method.to_sql('payment_method', engine, if_exists='replace', index=False)
client.to_sql('client', engine, if_exists='replace', index=False)

457